tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'universal-ctags/universal-ctags'
tap 'd12frosted/emacs-plus'
tap 'neovim/neovim'

brew 'autoconf'
brew 'readline'
brew 'xz'
brew 'automake'
brew 'cmake'
brew 'coreutils'
brew 'gdbm'
brew 'pcre'
brew 'git'
brew 'git-flow-avh'
brew 'tig'
brew 'go'
brew 'libtool'
brew 'htop-osx'
brew 'httpie'
brew 'pkg-config'
brew 'makedepend'
brew 'openssl'
brew 'libevent'
brew 'postgresql'
brew 'pgcli'
brew 'mysql'
brew 'redis'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'elixir'
brew 'terminal-notifier'
brew 'reattach-to-user-namespace'
brew 'rtmpdump'
brew 'scmpuff'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'
brew 'emacs-plus'
brew 'neovim'
brew 'wget'
brew 'zsh'
brew 'zplug'
brew 'tmate'
brew 'global'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'ffmpeg'
brew 'youtube-dl'
brew 'tmux-mem-cpu-load'

brew 'koekeishiya/formulae/khd'

cask 'filebot'
