tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'
tap 'neovim/neovim'
tap 'mas-cli/tap'
tap 'buo/cask-upgrade'

# Build Tools
brew 'automake'
brew 'autoconf'
brew 'gpg'
brew 'libyaml'
brew 'libffi'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'readline'
brew 'xz'
brew 'coreutils'
brew 'openssl'
brew 'jemalloc'

# Development Tools
brew 'git'
brew 'tig' # git log
brew 'sqlite'
brew 'diff-so-fancy' # git diff
brew 'git-delta' # git diff
brew 'scmpuff' # git management
brew 'the_silver_searcher' # search
brew 'ripgrep' # search
brew 'jq' # json
brew 'awk'

# Utitlies
brew 'zsh'
brew 'htop-osx'
brew 'wget'
brew 'tmux'
brew 'tmate'
brew 'tmux-mem-cpu-load'
brew 'reattach-to-user-namespace'
brew 'terminal-notifier'
brew 'ffmpeg'
brew 'rtmpdump'
# du replacement
brew 'ncdu'
# twitch livestreamer
brew 'streamlink'
brew 'sensiblesidebuttons'

brew 'tree'
# tree replacement
brew 'broot'
# Cat replacement
brew 'bat'
# Fuzzy search
brew 'fzf'
# ls replacement
brew 'exa'
# multiple concurrent downloads
brew 'aria2'
# symlink management
brew 'stow'
# find replacement
brew 'fd'

# Desktop Managers
brew 'koekeishiya/formulae/skhd'
brew 'yabai'

# Text Editors
# brew "vim"
# brew "emacs-plus"
# brew "neovim"
