tap 'homebrew/bundle'
tap 'neovim/neovim'
tap 'mas-cli/tap'
tap 'buo/cask-upgrade'

# Build Tools
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'gpg'
brew 'jemalloc'
brew 'libffi'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'unixodbc'
brew 'xz'
brew 'zlib'

# Development Tools
brew 'awk'
brew 'diff-so-fancy' # git diff
brew 'fx' # json tui
brew 'git'
brew 'git-delta' # git diff
brew 'jq' # json
brew 'overmind' # process launcher
brew 'ripgrep' # search
brew 'scmpuff' # git management
brew 'sqlite'
brew 'the_silver_searcher' # search
brew 'tig' # git log

# Formatters
brew 'lua-language-server'
brew 'shfmt'
brew 'stylua'

# Utitlies
# du replacement
brew 'ffmpeg'
brew 'htop-osx'
cask 'jordanbaird-ice' #bartender replacement
brew 'ncdu'
brew 'reattach-to-user-namespace'
brew 'rtmpdump'
brew 'terminal-notifier'
brew 'tmate'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'wget'
brew 'zsh'

brew 'tree'
# tree replacement
brew 'broot'
# Cat replacement
brew 'bat'
# Fuzzy search
brew 'fzf'
# ls replacement
brew 'eza'
# multiple concurrent downloads
brew 'aria2'
# symlink management
brew 'stow'
# find replacement
brew 'fd'
# screenshot utility
cask 'shottr'
 # video preview in finder
cask 'qlvideo'

# Desktop Managers
brew 'koekeishiya/formulae/skhd'
brew 'yabai'

# Fonts
# Powerline Fonts
cask 'font-consolas-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-cascadia-mono-pl'

# Nerd Fonts
# https://github.com/ryanoasis/nerd-fonts
cask 'font-anonymice-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-go-mono-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-liberation-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-fantasque-sans-mono-nerd-font'
