tap 'homebrew/cask-fonts'

# Powerline Fonts
cask 'font-consolas-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-cascadia-mono-pl'

# Nerd Fonts
# https://github.com/ryanoasis/nerd-fonts
cask 'font-anonymice-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-go-mono-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-liberation-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'font-blex-mono-nerd-font'

# Programming Fonts
cask 'font-input'
