tap "caskroom/cask"
tap "homebrew/bundle"
tap "universal-ctags/universal-ctags"
tap "d12frosted/emacs-plus"
tap "neovim/neovim"
tap "mas-cli/tap"

# Build Tools
brew "readline"
brew "coreutils"
brew "openssl"

# Development Tools
brew "git"
brew "tig"
brew "pgcli"
brew "sqlite"
brew "diff-so-fancy"
brew "scmpuff"
brew "the_silver_searcher"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Programming Languages
brew "ruby-build"
brew "rbenv"
brew "elixir"
brew "nvm"
brew "go"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"

# Utitlies
brew "zsh"
brew "zplug"
brew "mas"
brew "htop-osx"
brew "wget"
brew "tmux"
brew "tmate"
brew "tmux-mem-cpu-load"
brew "reattach-to-user-namespace"
brew "terminal-notifier"
brew "ffmpeg"
brew "youtube-dl"
brew "rtmpdump"

brew "tree"
brew "bat"
brew "fzf"
brew "exa"
brew "axel"
brew "stow"

# Text Editors
brew "vim"
brew "emacs-plus"
brew "neovim"
